人生杂谈/blog.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-07-20 Sat 10:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>关于博客</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="qxg" />
<link rel="shortcut icon" type="image/x-icon" href="/static/img/favicon.ico">
<link rel="stylesheet" type="text/css" href="/static/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/static/css/readtheorg.css"/><link rel="stylesheet" type="text/css" href="/static/css/orgstyle.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/index.html"> UP </a>
 |
 <a accesskey="H" href="/index.html"> HOME </a>
</div><div id="content">
<h1 class="title">关于博客</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4471201">一</a></li>
</ul>
</div>
</div>

<div id="outline-container-org4471201" class="outline-2">
<h2 id="org4471201">一</h2>
<div class="outline-text-2" id="text-org4471201">
<p>
blog这个东西其实折腾了好久了，刚开始是用的hexo+gitpage来写的博客，各种东西应有尽有，比如评论，阅读数量，访问数量什么的，也做了搜索优化等等，但是后来发现博客好丑，写博客也不方便，每次都要打开一个md文档，写完后还要用hexo生成，然后提交到github，而且还遇到过博客内容丢失的情况，比如硬盘损坏，虽然博客提交到了github上，但是源文件却没有保留，总之是非常麻烦。
后来发现了简书，觉得他还蛮方便的，于是后续把一些学习笔记都记录到了简书上，但是又有了新的担心，万一哪天简书挂了，记录的内容不就都没了么。
再后来就转移到了org-mode上了，刚开始觉得这玩意挺方便的，记录的笔记的时候的格式也挺让人满意的，于是对他一顿折腾。后来还是有了但是，总觉得少点什么，我理性的想了想，现在网上鱼龙混杂，各种博客都有，今天打开一个博客，排版好看，很吸引我，我就想把博客搞成他的那样子，明天再打开一个博客，又是一个新的风格，又吸引到了我，如果这样的话，折腾的心是无穷无尽的。
我反思了一下，其实现在的博客就挺好的，反正也没人看，就不需要什么评论，什么阅读数量，只当作个人的笔记记录存放地就挺好的，像自己的小窝一样，也不需要做搜索优化，不需要搜索引擎爬取，在这吐槽生活吐槽工作，记录心得，何乐而不为呢，为什么非要搞个好看的，各种内容都有的，然后没人看，内容也不丰富，写得一坨屎，折腾完了，又腻了，又想换风格，得了，打住吧，要理解好自己的定位。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: qxg</p>
<p class="date">Created: 2019-07-20 Sat 10:18</p>
<p class="validation"></p>
</div>
</body>
</html>
